InformationRegisters/СопутствующиеТоварыИУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СопутствующиеТоварыИУслуги</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>#12082 отключена проверка заполнения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФиксированноеКоличество</Name>
					<Comment>#88</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокОкругленияЧислом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СопутствующийТовар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаСопутствующегоТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СопутствующиеТоварыИУслуги/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Элементы.Характеристика.Видимость = Запись.Номенклатура.ИспользоватьХарактеристики;
	//Элементы.ХарактеристикаСопутствующегоТовара.Видимость = Запись.СопутствующийТовар.ИспользоватьХарактеристики;
	
	Если Параметры.Ключ.Пустой() И Параметры.Свойство("ЗначенияЗаполнения") Тогда
		ЗаполнитьЗначенияСвойств(Запись, Параметры.ЗначенияЗаполнения);
	КонецЕсли;
	
	ОбщийМодульСервер.ЗаполнитьПредопределенныеПорядкиОкругления(Элементы.ПорядокОкругленияЧислом);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Запись.Номенклатура = Запись.СопутствующийТовар
		И Запись.Характеристика = Запись.ХарактеристикаСопутствующегоТовара Тогда
		СтрокаСообщения = НСтр("ru = 'Значения элементов групп ""Номенклатура"" и ""Сопутствующий товар"" не могут совпадать.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения,,ЭтаФорма);
		Отказ = Истина;
	КонецЕсли;
	
	//++ #16036 Проверка на закольцовку
	Если ПроверкаСопутствующейНоменклатурыНаЗакольцовку(Запись.Номенклатура, Запись.Характеристика,Запись.СопутствующийТовар, Запись.ХарактеристикаСопутствующегоТовара) Тогда
		СтрокаСообщения = НСтр("ru = 'Добавляемая номенклатура является участником цепочки как один из родителей'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения,,ЭтаФорма);
		Отказ = Истина;
	КонецЕсли;
	//-- #16036
	
КонецПроцедуры

//++ #16036 Проверка на закольцовку
&НаСервере
Функция ПроверкаСопутствующейНоменклатурыНаЗакольцовку(Знач Номенклатура, Знач Характеристика, СопутствующийТовар, ХарактеристикаСопутствующегоТовара)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СопутствующиеТоварыИУслуги.Номенклатура КАК Номенклатура,
		|	СопутствующиеТоварыИУслуги.Характеристика КАК Характеристика
		|ИЗ
		|	РегистрСведений.СопутствующиеТоварыИУслуги КАК СопутствующиеТоварыИУслуги
		|ГДЕ
		|	СопутствующиеТоварыИУслуги.СопутствующийТовар = &НоменклатураПоиска
		|	И СопутствующиеТоварыИУслуги.ХарактеристикаСопутствующегоТовара = &ХарактеристикаПоиска";
	Запрос.УстановитьПараметр("НоменклатураПоиска", Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаПоиска", Характеристика);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Номенклатура = СопутствующийТовар И Выборка.Характеристика = ХарактеристикаСопутствующегоТовара Тогда
			Возврат Истина;
		КонецЕсли;	
		Если ПроверкаСопутствующейНоменклатурыНаЗакольцовку(Выборка.Номенклатура, Выборка.Характеристика, СопутствующийТовар, ХарактеристикаСопутствующегоТовара) Тогда
			Возврат Истина;
		КонецЕсли;		
	КонецЦикла;
	Возврат Ложь;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура НоменклатураПриИзмененииНаСервере()
	
	//Элементы.Характеристика.Видимость = Запись.Номенклатура.ИспользоватьХарактеристики;
	Запись.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	НоменклатураПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СопутствующийТоварПриИзмененииНаСервере()
	
	//Элементы.ХарактеристикаСопутствующегоТовара.Видимость = Запись.СопутствующийТовар.ИспользоватьХарактеристики;
	Запись.ХарактеристикаСопутствующегоТовара = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	
	Запись.ЕдиницаИзмерения = Запись.СопутствующийТовар.БазоваяЕдиницаИзмерения;
	Запись.Коэффициент = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура СопутствующийТоварПриИзменении(Элемент)
	СопутствующийТоварПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении(Элемент)
	
	Если ТипЗнч(Запись.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		Запись.Коэффициент = 1;
	Иначе
		Запись.Коэффициент = ОбщийМодульВызовСервера.ПолучитьКоэффициентЕдиницыИзмерения(Запись.ЕдиницаИзмерения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(Запись.СопутствующийТовар);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		Запись.Коэффициент = 1;
	Иначе
		Запись.Коэффициент = ОбщийМодульВызовСервера.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	МобильныйКлиент.ОбновитьФлагАктуальностиНоменклатурыМобильногоКлиентаНоменклатураПриЗаписи(ТекущийОбъект.Номенклатура, Ложь);
КонецПроцедуры

#КонецОбласти
